InformationRegisters/ПользователиУправленческихПодсистем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ПользователиУправленческихПодсистем</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Контролер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ДО_ОбщийМодуль/Ext/Module.bsl
Функция Запуск1СВозможен() Экспорт 
	Рез = Истина;
	
	Если РольДоступна("УпрДенежныеСредства") Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПользователиУправленческихПодсистем.Пользователь
			|ИЗ
			|	РегистрСведений.ПользователиУправленческихПодсистем КАК ПользователиУправленческихПодсистем
			|ГДЕ
			|	ПользователиУправленческихПодсистем.Пользователь = &Пользователь
			|	И ПользователиУправленческихПодсистем.ДДС";
		
		Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если не ВыборкаДетальныеЗаписи.Следующий() Тогда 
			Рез = Ложь;
		КонецЕсли;
	КонецЕсли;	
	
	Возврат Рез;
КонецФункции	

Функция ЭтоУпрКонтролер() Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПользователиУправленческихПодсистем.Пользователь
		|ИЗ
		|	РегистрСведений.ПользователиУправленческихПодсистем КАК ПользователиУправленческихПодсистем
		|ГДЕ
		|	ПользователиУправленческихПодсистем.Пользователь = &Пользователь
		|	И ПользователиУправленческихПодсистем.Контролер";
	
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Возврат ВыборкаДетальныеЗаписи.Следующий();
КонецФункции
